<?php

// lang/en/messages.php

return [
    'site_name' => 'MTS',
    'main' => 'Главная',
    'main_page' => 'Главная страница',
    'search' => 'Поиск',
    'more' => 'Подробнее',
    'published' => 'Опубликовано',
    'unpublished' => 'Снято с публикации',
    'save' => 'Сохранить',
    'update' => 'Обновить',
    'copy' => 'Скопировано',

    'year_graduation_from' => 'Год начала',
    'year_graduation_to' => 'Год окончания',
    'gave_super_admin' => 'Пользователю :user_name даны права супер администратора',
    'take_super_admin' => 'У пользователя :user_name отобраны права супер администратора',

    'feedback' => [
        'plural' => 'Отзывы',
        'single' => 'Отзыв',
        'list' => 'Список отзывов',
        'create' => 'Создать отзыв',
        'edit' => 'Редактировать отзыв',
        'none' => 'Отзывов пока что не создано...',
        'success' => [
            'store' => 'Отзыв создан',
            'update' => 'Отзыв изменён',
            'destroy' => 'Отзыв удалён',
        ],
        'error' => [
            'store' => 'Отзыв не создан',
            'update' => 'Отзыв не изменён',
            'destroy' => 'Отзыв не удалён',
        ],
    ],

    'category' => [
        'plural' => 'Категории',
        'single' => 'Категория',
        'list' => 'Список категорий',
        'create' => 'Создать категорию',
        'edit' => 'Редактировать категорию',
        'none' => 'Категорий пока что не создано...',
        'success' => [
            'store' => 'Категория создана',
            'update' => 'Категория изменена',
            'destroy' => 'Категория удалена',
        ],
        'error' => [
            'store' => 'Категория не создана',
            'update' => 'Категория не изменена',
            'destroy' => 'Категория не удалена',
        ],
    ],

    'company' => [
        'plural' => 'Производители',
        'single' => 'Производитель',
        'list' => 'Список производителей',
        'create' => 'Создать производителя',
        'edit' => 'Редактировать производителя',
        'none' => 'Производителей пока что не создано...',
        'success' => [
            'store' => 'Производитель создан',
            'update' => 'Производитель изменён',
            'destroy' => 'Производитель удалён',
        ],
        'error' => [
            'store' => 'Производитель не создан',
            'update' => 'Производитель не изменён',
            'destroy' => 'Производитель не удалён',
        ],
    ],

    'article' => [
        'plural' => 'Новости',
        'single' => 'Новость',
        'list' => 'Список новостей',
        'create' => 'Создать новость',
        'edit' => 'Редактировать новость',
        'none' => 'Новостей пока что не создано...',
        'success' => [
            'store' => 'Новость создана',
            'update' => 'Новость изменена',
            'destroy' => 'Новость удалена',
        ],
        'error' => [
            'store' => 'Новость не создана',
            'update' => 'Новость не изменена',
            'destroy' => 'Новость не удалена',
        ],
    ],

    'photo' => [
        'plural' => 'Фотографии',
        'single' => 'Фотография',
        'list' => 'Список фотографий',
        'create' => 'Создать фотографию',
        'edit' => 'Редактировать фотографию',
        'none' => 'Фотографий пока что не создано...',
        'success' => [
            'store' => 'Фотография создана',
            'update' => 'Фотография изменена',
            'destroy' => 'Фотография удалена',
        ],
        'error' => [
            'store' => 'Фотография не создана',
            'update' => 'Фотография не изменена',
            'destroy' => 'Фотография не удалена',
        ],
    ],

    'token' => [
        'plural' => 'Токены',
        'single' => 'Токен',
        'list' => 'Список токенов',
        'create' => 'Создать токен',
        'edit' => 'Редактировать токен :token',
        'none' => 'Токенов пока что не создано...',
        'success' => [
            'store' => 'Токен создан',
            'update' => 'Токен изменён',
            'destroy' => 'Токен удалён',
        ],
        'error' => [
            'store' => 'Токен не создан',
            'update' => 'Токен не изменён',
            'destroy' => 'Токен не удалён',
        ],
    ],

    'user' => [
        'plural' => 'Пользователи',
        'single' => 'Пользователь',
        'list' => 'Список пользователей',
        'create' => 'Создать пользователя',
        'edit' => 'Редактировать пользователя :user',
        'none' => 'Пользователей пока что не создано...',
        'change-password' => 'Сменить пароль',
        'success' => [
            'store' => 'Пользователь создан',
            'update' => 'Пользователь изменен',
            'destroy' => 'Пользователь удалён',
        ],
        'error' => [
            'store' => 'Пользователь не создан',
            'update' => 'Пользователь не изменен',
            'destroy' => 'Пользователь не удалён',
            'restricted' => 'Недостаточно прав для удаления пользователей',
            'my-self' => 'Нельзя удалить самого себя',
        ],
    ],

    'auth' => [
        'login' => 'Вход в аккаунт',
        'logout' => 'Выход из аккаунта',
        'success' => 'Вы авторизованы',
        'error' => 'Неправильный логин и/или пароль',
    ],
];
